Revit 2026 API

# FabricationPartIsProductList Method

---

Gets whether or not the fabrication part is a product list.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsProductList()
```
```vb
Public Function IsProductList As Boolean
```
```cpp
public:
bool IsProductList()
```
```fsharp
member IsProductList : unit -> bool
```

#### Return Value

Boolean Returns true if the fabrication part is a product list.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | the fabrication part is not a product list. |

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace